import React from 'react';
import '../styles/AboutPage.css';

const AboutPage = () => {
    return (
        <div className="about-page">
            <h1>О нас</h1>
            <p><strong>TotalParts.kg</strong> — ведущий поставщик автозапчастей в Кыргызстане, специализирующийся на обеспечении водителей и автосервисов качественными комплектующими для всех популярных марок и моделей автомобилей. Наша компания ориентирована на высокие стандарты обслуживания и поставляет продукцию, которая соответствует международным требованиям надежности и безопасности.</p>
            
            <h2>Почему выбирают TotalParts.kg?</h2>
            <ul>
                <li>Гарантированное качество. Мы сотрудничаем только с проверенными поставщиками и предлагаем оригинальные запчасти и надежные аналоги, соответствующие строгим стандартам.</li>
                <li>Профессионализм и опыт. В нашей команде — квалифицированные специалисты с глубоким пониманием потребностей автомобилистов и автосервисов. Они готовы помочь подобрать оптимальные решения и проконсультировать по всем вопросам.</li>
                <li>Скорость и оперативность. Мы понимаем ценность времени для наших клиентов и обеспечиваем быструю обработку и доставку заказов по всей территории Кыргызстана.</li>
                <li>Ответственность перед клиентами. Мы ориентированы на долгосрочное сотрудничество и предоставляем гарантии на все поставляемые запчасти.</li>
            </ul>

            <h2>Почему именно мы?</h2>
            <p><strong>TotalParts.kg</strong> предлагает не просто автозапчасти, а комплексное решение для эффективной эксплуатации вашего автомобиля. Мы понимаем потребности наших клиентов и всегда готовы предоставить надежные и качественные детали для вашего автомобиля по конкурентоспособной цене. Наш опыт, стремление к качеству и забота о клиентах делают нас вашим надежным партнером на пути к безопасной эксплуатации автомобиля.</p>
        </div>
    );
};

export default AboutPage;
